In [1]:
import numpy as np
import pandas as pd

# DataFrames

A DataFrame is a two-dimensional numpy array with an index for rows and an index for columns. There are many ways to build a DataFrame.

In [2]:
# Let's create a Series to define ages
age = pd.Series([30, 20, 50], index=['alice', 'bob', 'julie'])

# and a Series to define size
height = pd.Series([150, 170, 168], index=['alice', 'marc', 'julie'])

# We can now combine these two Series in DataFrame,
# each Series defining a column, one way to do this is
# define a dictionary which contains the name of the column as a key
# and for value the corresponding Series

stat = pd.DataFrame({'age': age, 'height': height})

In [3]:
stat

        age  height
alice  30.0   150.0
bob    20.0     NaN
julie  50.0   168.0
marc    NaN   170.0

Note that `pandas` automatically aligns the indexes, when a value is not present, it is automatically replaced by `NaN`. `Panda` will also broadcaster a single value defining a column on all rows. Let's look at this:

In [4]:
stat = pd.DataFrame({'age': age, 'height': height, 'city': 'Marseille'})
print(stat)

        age  height       city
alice  30.0   150.0  Marseille
bob    20.0     NaN  Marseille
julie  50.0   168.0  Marseille
marc    NaN   170.0  Marseille

In [5]:
# We can now access the index of rows and columns

# rows index
print(stat.index)

Index(['alice', 'bob', 'julie', 'marc'], dtype='object')

In [6]:
# columns index
print(stat.columns)

Index(['age', 'height', 'city'], dtype='object')

There are many ways to access `DataFrame` elements, some are good and some should be avoided, let's start with some good habits. As this is a two-dimensional structure, you must give a row and column index:

In [7]:
# How old is alice
a = stat.loc['alice', 'age']

In [8]:
type(a), a # a is a float num

(numpy.float64, 30.0)

In [9]:
# What is the average of all ages
c = stat.loc[:, 'age']
m = c.mean()
print(f"Average age is {m:.1f}")

Average age is 33.3

In [10]:
# c is a Series
type(c)

pandas.core.series.Series

In [11]:
# and m is float
type(m)

float

We can already note several interesting things:
- You can use `.loc[]` and `.iloc` as for the `Series`. For `DataFrame` it is even more important because there is more risk of ambiguities (especially between rows and columns);
- the `mean` method calculates the mean, that's not surprising, but ignores the `NaN`. This is usually what we want. If you are wondering how to tell whether or not the method you are using ignores `NaN`, your best bet is to have a look at the help for that method. There are two versions for a number of methods: one which ignores the `NaN` and another which takes them into account.

Another way to construct a `DataFrame` is to start from an `array` of `numpy`, and specify the indexes for rows and columns with the `index` and `columns` arguments:

In [12]:
a = np.random.randint(1, 20, 9).reshape(3, 3)
p = pd.DataFrame(a, index=['a', 'b', 'c'], columns=['x', 'y', 'z'])
print(p)

    x   y   z
a  12  11   5
b   5   4  19
c  18  10   3

### Handling a `DataFrame`

In [13]:
# now let's build a DataFrame

# here is a list of first names
names = ['alice', 'bob', 'marc', 'bill', 'sonia']

# let's create three Series which form the three columns
age = pd.Series([12, 13, 16, 11, 16], index=names)
height = pd.Series([130, 140, 176, 120, 165], index=names)
sex = pd.Series(list('fmmmf'), index=names)

p = pd.DataFrame({'age': age, 'height': height, 'sex': sex})
print(p)

       age  height sex
alice   12     130   f
bob     13     140   m
marc    16     176   m
bill    11     120   m
sonia   16     165   f

In [14]:
# and load the seaborn tips dataset
import seaborn as sns
tips = sns.load_dataset('tips')

`pandas` offers many possibilities to explore the data. Attention, in my examples I will alternate between the `DataFrame` `p` and the `DataFrame` `tips` according to the needs of the explanation.

In [15]:
# display the first lines
tips.head ()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [16]:
# and the last lines
tips.tail ()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [17]:
# line index
p.index

Index(['alice', 'bob', 'marc', 'bill', 'sonia'], dtype='object')

In [18]:
# and column index
p.columns

Index(['age', 'height', 'sex'], dtype='object')

In [19]:
# and display only the values
p.values

array([[12, 130, 'f'],
       [13, 140, 'm'],
       [16, 176, 'm'],
       [11, 120, 'm'],
       [16, 165, 'f']], dtype=object)

In [20]:
# swap rows and columns
# cf. the transposition of matrices
p.T

       alice  bob marc bill sonia
age       12   13   16   11    16
height   130  140  176  120   165
sex        f    m    m    m     f

Finally, there is the `describe` method which allows to obtain the first statistics on a `DataFrame`. `describe` allows you to calculate statistics on numeric types, but also on character string types.

In [21]:
# by default describe only considers numeric columns
p.describe ()

             age      height
count   5.000000    5.000000
mean   13.600000  146.200000
std     2.302173   23.605084
min    11.000000  120.000000
25%    12.000000  130.000000
50%    13.000000  140.000000
75%    16.000000  165.000000
max    16.000000  176.000000

In [22]:
# but we can force it to take into account all the columns
p.describe (include = 'all')

              age      height  sex
count    5.000000    5.000000    5
unique        NaN         NaN    2
top           NaN         NaN    m
freq          NaN         NaN    3
mean    13.600000  146.200000  NaN
std      2.302173   23.605084  NaN
min     11.000000  120.000000  NaN
25%     12.000000  130.000000  NaN
50%     13.000000  140.000000  NaN
75%     16.000000  165.000000  NaN
max     16.000000  176.000000  NaN

### Queries on a `DataFrame`

We can now start making queries on `DataFrames`. The `DataFrame` support the notion of mask that we have seen for the `ndarray` of `numpy` and for the `Series`.

In [23]:
# p.loc takes either a row label
print (p.loc ['sonia'])

age        16
height    165
sex         f
Name: sonia, dtype: object

In [24]:
# or a row AND column label
print (p.loc ['sonia', 'age'])

16

We can put in place of a label:

- a list of labels;
- a slice on the labels;
- a mask (that is to say an array of Booleans);
- a callable which returns one of the first three possibilities.

Note that we can also use the `.iloc[]` notation with the same rules, but it is less useful.

I recommend always using the `.loc[rows, columns]` notation to avoid ambiguity. We will see that notations `.loc[lines]` or worse only `[label]` are sources of errors.

Now let's look at some more sophisticated examples:

In [25]:
# a mask on women
p.loc[:, 'sex'] == 'f'

alice     True
bob      False
marc     False
bill     False
sonia     True
Name: sex, dtype: bool

In [26]:
# so that to build an array
# with only women
p.loc[p.loc [:, 'sex'] == 'f',:]

       age  height sex
alice   12     130   f
sonia   16     165   f

In [27]:
# if we don't want to keep only
# than women over 14
p.loc[(p.loc[:, 'sex'] == 'f') & (p.loc[:, 'age']> 14),:]

       age  height sex
sonia   16     165   f

In [28]:
# what is the average of 'total_bill' for women
addition_f = tips.loc[tips.loc[:, 'sex'] == 'Female', 'total_bill'].mean ()
print (f"average addition of women: {addition_f: .2f}")

average addition of women:  18.06

In [29]:
# what is the average of 'total_bill' of men
addition_h = tips.loc[tips.loc[:, 'sex'] == 'Male', 'total_bill'].mean ()
print (f"average addition of men: {addition_h: .2f}")

average addition of men:  20.74

In [30]:
# who leaves the greatest percentage tip:
# men or women?

tip_f = tips.loc[tips.loc [:, 'sex'] == 'Female', 'tip'].mean ()
tip_h = tips.loc[tips.loc [:, 'sex'] == 'Male', 'tip'].mean ()

print (f"Women leave {tip_f / addition_f: .2%} tip")
print (f"Men leave {tip_h / addition_h: .2%} tip")

Women leave  15.69% tip
Men leave  14.89% tip

### Frequent errors and ambiguities on requests

We have seen a simple and unambiguous way to query `DataFrame`. We will see that there are other ways which have the sole advantage of being more concise, but sources of many errors.

**Remember, always use the `.loc [rows, columns] notation` otherwise, be sure you know what is actually being calculated**.